In [4]:
import pandas as pd
import numpy as np

Series

In [5]:
s = pd.Series([45,22,17,5,33,16,85])

In [6]:
s

0    45
1    22
2    17
3     5
4    33
5    16
6    85
dtype: int64

In [7]:
s = pd.Series([45,22,17,5,33,16,85], dtype = np.int8)

In [8]:
s

0    45
1    22
2    17
3     5
4    33
5    16
6    85
dtype: int8

In [9]:
type(s)

pandas.core.series.Series

In [10]:
s.dtype

dtype('int8')

In [11]:
s.shape

(7,)

In [12]:
s.size

7

In [13]:
s.values

array([45, 22, 17,  5, 33, 16, 85], dtype=int8)

##### DataFrame

In [14]:
r = pd.Series([1,2,3,4,5])
n = pd.Series(['nitin','rajan','rani','priya','manoj'])
m = pd.Series([56.78,76.23, 67.89, 77.45, 71.34])

In [17]:
df = pd.DataFrame({
    'roll': r,
    'name': n,
    'marks': m,
})
df

   roll   name  marks
0     1  nitin  56.78
1     2  rajan  76.23
2     3   rani  67.89
3     4  priya  77.45
4     5  manoj  71.34

In [18]:
type(df)

pandas.core.frame.DataFrame

In [19]:
df.dtypes

roll       int64
name      object
marks    float64
dtype: object

In [20]:
df.shape

(5, 3)

In [21]:
df.size

15

##### Dataset

In [22]:
# https://mitu.co.in/dataset
# Download al the files whose name starts with student*
# Store in current working directory in folder datasets/

##### Load the data

In [23]:
df = pd.read_csv('datasets/student.csv')

In [24]:
df

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [25]:
type(df)

pandas.core.frame.DataFrame

In [26]:
df1 = pd.read_csv('datasets/student1.csv')

In [27]:
df1

    1     anil  TE  56.77  22
0   2     amit  TE  59.77  21
1   3   aniket  BE  76.88  19
2   4  ajinkya  TE  69.66  20
3   5     asha  TE  63.28  20
4   6   ayesha  BE  49.55  20
5   7     amar  BE  65.34  19
6   8    amita  BE  68.33  23
7   9     amol  TE  56.75  20
8  10    anmol  BE  78.66  21

In [29]:
df1 = pd.read_csv('datasets/student1.csv', names=['A','B','C','D','E'])

In [30]:
df1

    A        B   C      D   E
0   1     anil  TE  56.77  22
1   2     amit  TE  59.77  21
2   3   aniket  BE  76.88  19
3   4  ajinkya  TE  69.66  20
4   5     asha  TE  63.28  20
5   6   ayesha  BE  49.55  20
6   7     amar  BE  65.34  19
7   8    amita  BE  68.33  23
8   9     amol  TE  56.75  20
9  10    anmol  BE  78.66  21

In [31]:
None

In [32]:
df1 = pd.read_csv('datasets/student1.csv', names=None)

In [33]:
df1

    1     anil  TE  56.77  22
0   2     amit  TE  59.77  21
1   3   aniket  BE  76.88  19
2   4  ajinkya  TE  69.66  20
3   5     asha  TE  63.28  20
4   6   ayesha  BE  49.55  20
5   7     amar  BE  65.34  19
6   8    amita  BE  68.33  23
7   9     amol  TE  56.75  20
8  10    anmol  BE  78.66  21

In [34]:
df1 = pd.read_csv('datasets/student1.csv', header=None)

In [35]:
df1

    0        1   2      3   4
0   1     anil  TE  56.77  22
1   2     amit  TE  59.77  21
2   3   aniket  BE  76.88  19
3   4  ajinkya  TE  69.66  20
4   5     asha  TE  63.28  20
5   6   ayesha  BE  49.55  20
6   7     amar  BE  65.34  19
7   8    amita  BE  68.33  23
8   9     amol  TE  56.75  20
9  10    anmol  BE  78.66  21

In [36]:
df3 = pd.read_csv('datasets/student3.tsv')

In [37]:
df3

  roll\tname\tclass\tmarks\tage
0        1\tanil\tTE\t56.77\t22
1        2\tamit\tTE\t59.77\t21
2      3\taniket\tBE\t76.88\t19
3     4\tajinkya\tTE\t69.66\t20
4        5\tasha\tTE\t63.28\t20
5      6\tayesha\tBE\t49.55\t20
6        7\tamar\tBE\t65.34\t19
7       8\tamita\tBE\t68.33\t23
8        9\tamol\tTE\t56.75\t20
9      10\tanmol\tBE\t78.66\t21

In [38]:
df3 = pd.read_csv('datasets/student3.tsv', sep='\t')
df3

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [39]:
df2 = pd.read_csv('https://raw.githubusercontent.com/mwaskom/seaborn-data/master/iris.csv')

In [40]:
df2

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

##### Access data information

In [41]:
df.shape

(10, 5)

In [42]:
df.size

50

In [43]:
df.dtypes

roll       int64
name      object
class     object
marks    float64
age        int64
dtype: object

In [44]:
df.columns

Index(['roll', 'name', 'class', 'marks', 'age'], dtype='object')

In [45]:
df.index

RangeIndex(start=0, stop=10, step=1)

In [46]:
df.values

array([[1, 'anil', 'TE', 56.77, 22],
       [2, 'amit', 'TE', 59.77, 21],
       [3, 'aniket', 'BE', 76.88, 19],
       [4, 'ajinkya', 'TE', 69.66, 20],
       [5, 'asha', 'TE', 63.28, 20],
       [6, 'ayesha', 'BE', 49.55, 20],
       [7, 'amar', 'BE', 65.34, 19],
       [8, 'amita', 'BE', 68.33, 23],
       [9, 'amol', 'TE', 56.75, 20],
       [10, 'anmol', 'BE', 78.66, 21]], dtype=object)

In [47]:
df.T

,0,1,2,3,4,5,6,7,8,9
roll,1,2,3,4,5,6,7,8,9,10
name,anil,amit,aniket,ajinkya,asha,ayesha,amar,amita,amol,anmol
class,TE,TE,BE,TE,TE,BE,BE,BE,TE,BE
marks,56.77,59.77,76.88,69.66,63.28,49.55,65.34,68.33,56.75,78.66
age,22,21,19,20,20,20,19,23,20,21

In [48]:
df.head()

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20

In [49]:
df.head(3)

   roll    name class  marks  age
0     1    anil    TE  56.77   22
1     2    amit    TE  59.77   21
2     3  aniket    BE  76.88   19

In [50]:
df.tail()

   roll    name class  marks  age
5     6  ayesha    BE  49.55   20
6     7    amar    BE  65.34   19
7     8   amita    BE  68.33   23
8     9    amol    TE  56.75   20
9    10   anmol    BE  78.66   21

In [51]:
df.tail(3)

   roll   name class  marks  age
7     8  amita    BE  68.33   23
8     9   amol    TE  56.75   20
9    10  anmol    BE  78.66   21

##### Index Based Slicing

In [52]:
x = df.iloc[2:8,1:4]
x

      name class  marks
2   aniket    BE  76.88
3  ajinkya    TE  69.66
4     asha    TE  63.28
5   ayesha    BE  49.55
6     amar    BE  65.34
7    amita    BE  68.33

In [54]:
df.iloc[:8,1:4]

      name class  marks
0     anil    TE  56.77
1     amit    TE  59.77
2   aniket    BE  76.88
3  ajinkya    TE  69.66
4     asha    TE  63.28
5   ayesha    BE  49.55
6     amar    BE  65.34
7    amita    BE  68.33

In [55]:
df.iloc[2:,1:4]

      name class  marks
2   aniket    BE  76.88
3  ajinkya    TE  69.66
4     asha    TE  63.28
5   ayesha    BE  49.55
6     amar    BE  65.34
7    amita    BE  68.33
8     amol    TE  56.75
9    anmol    BE  78.66

In [58]:
df.iloc[2:,1:]

      name class  marks  age
2   aniket    BE  76.88   19
3  ajinkya    TE  69.66   20
4     asha    TE  63.28   20
5   ayesha    BE  49.55   20
6     amar    BE  65.34   19
7    amita    BE  68.33   23
8     amol    TE  56.75   20
9    anmol    BE  78.66   21

In [59]:
df.iloc[[3,7,5,9],[1,3]]

      name  marks
3  ajinkya  69.66
7    amita  68.33
5   ayesha  49.55
9    anmol  78.66

In [60]:
df.iloc[[3,7,5,9],:]

   roll     name class  marks  age
3     4  ajinkya    TE  69.66   20
7     8    amita    BE  68.33   23
5     6   ayesha    BE  49.55   20
9    10    anmol    BE  78.66   21

In [61]:
df.iloc[4,:]

roll         5
name      asha
class       TE
marks    63.28
age         20
Name: 4, dtype: object

In [63]:
df.iloc[:,1]

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

In [64]:
df.iloc[3,1]

'ajinkya'

##### Label Based Slicing

In [65]:
df.loc[:,'name']

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

In [70]:
df.loc[:,['name','marks']]

      name  marks
0     anil  56.77
1     amit  59.77
2   aniket  76.88
3  ajinkya  69.66
4     asha  63.28
5   ayesha  49.55
6     amar  65.34
7    amita  68.33
8     amol  56.75
9    anmol  78.66

In [72]:
df['name']

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

In [73]:
df[['name','marks']]

      name  marks
0     anil  56.77
1     amit  59.77
2   aniket  76.88
3  ajinkya  69.66
4     asha  63.28
5   ayesha  49.55
6     amar  65.34
7    amita  68.33
8     amol  56.75
9    anmol  78.66

In [74]:
df.name

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

In [75]:
df.name.values

array(['anil', 'amit', 'aniket', 'ajinkya', 'asha', 'ayesha', 'amar',
       'amita', 'amol', 'anmol'], dtype=object)

In [76]:
df.drop(5)

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [78]:
df.drop([5,4,9])

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20

In [79]:
df.drop('class', axis = 1)

   roll     name  marks  age
0     1     anil  56.77   22
1     2     amit  59.77   21
2     3   aniket  76.88   19
3     4  ajinkya  69.66   20
4     5     asha  63.28   20
5     6   ayesha  49.55   20
6     7     amar  65.34   19
7     8    amita  68.33   23
8     9     amol  56.75   20
9    10    anmol  78.66   21

In [81]:
df.drop(['class','age'], axis = 1)

   roll     name  marks
0     1     anil  56.77
1     2     amit  59.77
2     3   aniket  76.88
3     4  ajinkya  69.66
4     5     asha  63.28
5     6   ayesha  49.55
6     7     amar  65.34
7     8    amita  68.33
8     9     amol  56.75
9    10    anmol  78.66

In [82]:
df.shape

(10, 5)

In [83]:
df.drop(['class','age'], axis = 1, inplace=True)

In [84]:
df.shape

(10, 3)

In [85]:
print(df)

   roll     name  marks
0     1     anil  56.77
1     2     amit  59.77
2     3   aniket  76.88
3     4  ajinkya  69.66
4     5     asha  63.28
5     6   ayesha  49.55
6     7     amar  65.34
7     8    amita  68.33
8     9     amol  56.75
9    10    anmol  78.66

In [86]:
df['marks'].min()

49.55

In [87]:
df['marks'].max()

78.66

In [88]:
df['marks'].mean()

64.499

In [89]:
df['marks'].median()

64.31

In [90]:
df['marks'].sum()

644.9899999999999

In [93]:
df['marks'].std()

9.207178901994535

In [94]:
df = pd.read_csv('datasets/student.csv')

In [95]:
df.count()

roll     10
name     10
class    10
marks    10
age      10
dtype: int64

In [96]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   roll    10 non-null     int64
 1   name    10 non-null     object
 2   class   10 non-null     object
 3   marks   10 non-null     float64
 4   age     10 non-null     int64
dtypes: float64(1), int64(2), object(2)
memory usage: 532.0+ bytes

In [98]:
df.describe()

           roll      marks        age
count  10.00000  10.000000  10.000000
mean    5.50000  64.499000  20.500000
std     3.02765   9.207179   1.269296
min     1.00000  49.550000  19.000000
25%     3.25000  57.520000  20.000000
50%     5.50000  64.310000  20.000000
75%     7.75000  69.327500  21.000000
max    10.00000  78.660000  23.000000

In [99]:
df.max()

roll         10
name     ayesha
class        TE
marks     78.66
age          23
dtype: object

In [100]:
df.sum()

roll                                                    55
name     anilamitaniketajinkyaashaayeshaamaramitaamolanmol
class                                 TETEBETETEBEBEBETEBE
marks                                               644.99
age                                                    205
dtype: object

In [102]:
df.std(numeric_only=True)

roll     3.027650
marks    9.207179
age      1.269296
dtype: float64

In [103]:
df.sum()

roll                                                    55
name     anilamitaniketajinkyaashaayeshaamaramitaamolanmol
class                                 TETEBETETEBEBEBETEBE
marks                                               644.99
age                                                    205
dtype: object

In [104]:
df.sum(axis=1, numeric_only=True)

0     79.77
1     82.77
2     98.88
3     93.66
4     88.28
5     75.55
6     91.34
7     99.33
8     85.75
9    109.66
dtype: float64

In [105]:
df

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [106]:
df['class'].value_counts()

class
TE    5
BE    5
Name: count, dtype: int64

In [107]:
df['age'].value_counts()

age
20    4
21    2
19    2
22    1
23    1
Name: count, dtype: int64

In [108]:
df.sort_values('class')

   roll     name class  marks  age
2     3   aniket    BE  76.88   19
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
9    10    anmol    BE  78.66   21
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
8     9     amol    TE  56.75   20

In [111]:
df.sort_values('class', ascending=False)

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
8     9     amol    TE  56.75   20
2     3   aniket    BE  76.88   19
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
9    10    anmol    BE  78.66   21

In [112]:
df.sort_values(['class','marks'])

   roll     name class  marks  age
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
2     3   aniket    BE  76.88   19
9    10    anmol    BE  78.66   21
8     9     amol    TE  56.75   20
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
4     5     asha    TE  63.28   20
3     4  ajinkya    TE  69.66   20

##### Custom Coiumn Operations

In [119]:
df['marks'] + 0.5

0    58.27
1    61.27
2    78.38
3    71.16
4    64.78
5    51.05
6    66.84
7    69.83
8    58.25
9    80.16
Name: marks, dtype: float64

In [117]:
df['marks'] = df['marks'] + 0.5

In [118]:
df

   roll     name class  marks  age
0     1     anil    TE  57.77   22
1     2     amit    TE  60.77   21
2     3   aniket    BE  77.88   19
3     4  ajinkya    TE  70.66   20
4     5     asha    TE  64.28   20
5     6   ayesha    BE  50.55   20
6     7     amar    BE  66.34   19
7     8    amita    BE  69.33   23
8     9     amol    TE  57.75   20
9    10    anmol    BE  79.66   21

In [122]:
df['cgpa'] = df['marks'] / 10 + 0.034

In [123]:
df

   roll     name class  marks  age   cgpa
0     1     anil    TE  57.77   22  5.811
1     2     amit    TE  60.77   21  6.111
2     3   aniket    BE  77.88   19  7.822
3     4  ajinkya    TE  70.66   20  7.100
4     5     asha    TE  64.28   20  6.462
5     6   ayesha    BE  50.55   20  5.089
6     7     amar    BE  66.34   19  6.668
7     8    amita    BE  69.33   23  6.967
8     9     amol    TE  57.75   20  5.809
9    10    anmol    BE  79.66   21  8.000

In [125]:
df['first_class'] =df['marks'] > 60

In [126]:
df

   roll     name class  marks  age   cgpa  first_class
0     1     anil    TE  57.77   22  5.811        False
1     2     amit    TE  60.77   21  6.111         True
2     3   aniket    BE  77.88   19  7.822         True
3     4  ajinkya    TE  70.66   20  7.100         True
4     5     asha    TE  64.28   20  6.462         True
5     6   ayesha    BE  50.55   20  5.089        False
6     7     amar    BE  66.34   19  6.668         True
7     8    amita    BE  69.33   23  6.967         True
8     9     amol    TE  57.75   20  5.809        False
9    10    anmol    BE  79.66   21  8.000         True

In [129]:
x = ['M','M','M','M','F','M','F','F','M','M']

In [130]:
df['gender'] = x
df

   roll     name class  marks  age   cgpa  first_class gender
0     1     anil    TE  57.77   22  5.811        False      M
1     2     amit    TE  60.77   21  6.111         True      M
2     3   aniket    BE  77.88   19  7.822         True      M
3     4  ajinkya    TE  70.66   20  7.100         True      M
4     5     asha    TE  64.28   20  6.462         True      F
5     6   ayesha    BE  50.55   20  5.089        False      M
6     7     amar    BE  66.34   19  6.668         True      F
7     8    amita    BE  69.33   23  6.967         True      F
8     9     amol    TE  57.75   20  5.809        False      M
9    10    anmol    BE  79.66   21  8.000         True      M

In [132]:
ndf = pd.DataFrame({
    'roll':range(1,11),
    'cgpa':df['marks'] / 10 + 0.034,
    'gender': ['M','M','M','M','F','M','F','F','M','M']

})

ndf

   roll   cgpa gender
0     1  5.811      M
1     2  6.111      M
2     3  7.822      M
3     4  7.100      M
4     5  6.462      F
5     6  5.089      M
6     7  6.668      F
7     8  6.967      F
8     9  5.809      M
9    10  8.000      M

In [133]:
df = pd.read_csv('datasets/student.csv')

In [134]:
df.columns

Index(['roll', 'name', 'class', 'marks', 'age'], dtype='object')

In [135]:
ndf.columns

Index(['roll', 'cgpa', 'gender'], dtype='object')

In [136]:
df.merge(ndf, on='roll')

   roll     name class  marks  age   cgpa gender
0     1     anil    TE  56.77   22  5.811      M
1     2     amit    TE  59.77   21  6.111      M
2     3   aniket    BE  76.88   19  7.822      M
3     4  ajinkya    TE  69.66   20  7.100      M
4     5     asha    TE  63.28   20  6.462      F
5     6   ayesha    BE  49.55   20  5.089      M
6     7     amar    BE  65.34   19  6.668      F
7     8    amita    BE  68.33   23  6.967      F
8     9     amol    TE  56.75   20  5.809      M
9    10    anmol    BE  78.66   21  8.000      M

In [139]:
df5 = pd.read_csv('datasets/student5.csv')

In [140]:
df5

   roll     name class  marks  age
0     1   surbhi    TE  67.44   23
1     2    sujay    TE  74.12   22
2     3  subhash    BE  82.44   21
3     4   sachin    TE  59.33   21
4     5  shalini    TE  63.45   20

In [141]:
pd.concat([df, df5])

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21
0     1   surbhi    TE  67.44   23
1     2    sujay    TE  74.12   22
2     3  subhash    BE  82.44   21
3     4   sachin    TE  59.33   21
4     5  shalini    TE  63.45   20

In [142]:
pd.concat([df, df5], ignore_index=True)

    roll     name class  marks  age
0      1     anil    TE  56.77   22
1      2     amit    TE  59.77   21
2      3   aniket    BE  76.88   19
3      4  ajinkya    TE  69.66   20
4      5     asha    TE  63.28   20
5      6   ayesha    BE  49.55   20
6      7     amar    BE  65.34   19
7      8    amita    BE  68.33   23
8      9     amol    TE  56.75   20
9     10    anmol    BE  78.66   21
10     1   surbhi    TE  67.44   23
11     2    sujay    TE  74.12   22
12     3  subhash    BE  82.44   21
13     4   sachin    TE  59.33   21
14     5  shalini    TE  63.45   20

##### String operations

In [144]:
name = 'Tushar'

In [145]:
name.lower()

'tushar'

In [146]:
name.replace('u','oo')

'Tooshar'

In [147]:
df['name'].str.upper()

0       ANIL
1       AMIT
2     ANIKET
3    AJINKYA
4       ASHA
5     AYESHA
6       AMAR
7      AMITA
8       AMOL
9      ANMOL
Name: name, dtype: object

In [148]:
df['name'].str.endswith('l')

0     True
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8     True
9     True
Name: name, dtype: bool

In [150]:
df['name'].str.startswith('an')

0     True
1    False
2     True
3    False
4    False
5    False
6    False
7    False
8    False
9     True
Name: name, dtype: bool

In [151]:
df['name'].str.replace('i','ee')

0       aneel
1       ameet
2     aneeket
3    ajeenkya
4        asha
5      ayesha
6        amar
7      ameeta
8        amol
9       anmol
Name: name, dtype: object

df['name'].str.count('a')

In [153]:
df['name'].str.find('i')

0    2
1    2
2    2
3    2
4   -1
5   -1
6   -1
7    2
8   -1
9   -1
Name: name, dtype: int64

df['name'].str.isalpha()

##### Groupng and Aggregation

In [158]:
gr = df.groupby('class')

In [159]:
gr.groups

{'BE': [2, 5, 6, 7, 9], 'TE': [0, 1, 3, 4, 8]}

In [161]:
gr.get_group('TE')

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
8     9     amol    TE  56.75   20

In [162]:
gr.min

In [163]:
gr['marks'].max()

class
BE    78.66
TE    69.66
Name: marks, dtype: float64

##### Boolean Filtering

In [166]:
df['marks'] > 60

0    False
1    False
2     True
3     True
4     True
5    False
6     True
7     True
8    False
9     True
Name: marks, dtype: bool

In [168]:
mask = df['marks'] > 60
df[mask]

   roll     name class  marks  age
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
9    10    anmol    BE  78.66   21

In [169]:
df[df['marks'] > 60]

   roll     name class  marks  age
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
9    10    anmol    BE  78.66   21

In [171]:
df[df['name'].str.startswith('an')]

   roll    name class  marks  age
0     1    anil    TE  56.77   22
2     3  aniket    BE  76.88   19
9    10   anmol    BE  78.66   21

In [174]:
x = df[(df['marks'] > 60) & (df['class'] == 'BE')]
x

   roll    name class  marks  age
2     3  aniket    BE  76.88   19
6     7    amar    BE  65.34   19
7     8   amita    BE  68.33   23
9    10   anmol    BE  78.66   21

##### Export the data

In [175]:
x.to_csv('datasets/output.csv', index=False)

In [176]:
x.to_html('datasets/output.html', index=False)